app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 2]]
SELECT "songs".* FROM "songs"
---
  def index
    if Artist.find_by(id: params[:artist_id])
      @songs = Artist.find(params[:artist_id]).songs
    elsif !Artist.find_by(id: params[:artist_id]) && params[:artist_id]
      artist_not_found
    else
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if params[:artist_id]
      @artist = Artist.find(params[:artist_id])
    end

    if Song.find_by(id: params[:id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "songs" SET "title" = ?, "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "Human Music"], ["artist_id", 6], ["updated_at", "2017-03-07 21:19:44.475440"], ["id", 9]]
---
  def update
    @song = Song.find(params[:id])

    @song.update(song_params)